{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "56"}, {"size": "68"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "11424"}, {"size": "1"}]}}}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3195623"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "3195623"}]}}}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/ScatterNd/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/clip_by_value/Minimum/y", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/PartitionedCall/gaussian_gen_net_tf/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/ScatterNd", "op": "ScatterNd", "input": ["PartitionedCall/gaussian_gen_net_tf/strided_slice", "unknown_0", "PartitionedCall/gaussian_gen_net_tf/ScatterNd/shape"], "attr": {"Tindices": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/Cast", "op": "Cast", "input": ["input_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/Reshape", "op": "Reshape", "input": ["PartitionedCall/gaussian_gen_net_tf/ScatterNd", "PartitionedCall/gaussian_gen_net_tf/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/MatMul", "op": "MatMul", "input": ["PartitionedCall/gaussian_gen_net_tf/Reshape", "PartitionedCall/gaussian_gen_net_tf/Cast"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/Add", "op": "AddV2", "input": ["unknown_1", "PartitionedCall/gaussian_gen_net_tf/MatMul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/clip_by_value/Minimum", "op": "Minimum", "input": ["PartitionedCall/gaussian_gen_net_tf/Add", "PartitionedCall/gaussian_gen_net_tf/clip_by_value/Minimum/y"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/clip_by_value", "op": "Maximum", "input": ["PartitionedCall/gaussian_gen_net_tf/clip_by_value/Minimum", "PartitionedCall/gaussian_gen_net_tf/clip_by_value/y"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/gaussian_gen_net_tf/clip_by_value", "PartitionedCall/gaussian_gen_net_tf/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/truediv", "op": "Mul", "input": ["PartitionedCall/gaussian_gen_net_tf/Reshape_1", "ConstantFolding/PartitionedCall/gaussian_gen_net_tf/truediv_recip"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "PartitionedCall/gaussian_gen_net_tf/Cast_1", "op": "Cast", "input": ["PartitionedCall/gaussian_gen_net_tf/truediv"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_HALF"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/gaussian_gen_net_tf/Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of7.bin", "group1-shard2of7.bin", "group1-shard3of7.bin", "group1-shard4of7.bin", "group1-shard5of7.bin", "group1-shard6of7.bin", "group1-shard7of7.bin"], "weights": [{"name": "unknown_1", "shape": [11424, 1], "dtype": "float32"}, {"name": "PartitionedCall/gaussian_gen_net_tf/strided_slice", "shape": [3195623, 1], "dtype": "int32"}, {"name": "unknown_0", "shape": [3195623], "dtype": "float32"}, {"name": "PartitionedCall/gaussian_gen_net_tf/ScatterNd/shape", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/gaussian_gen_net_tf/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/gaussian_gen_net_tf/clip_by_value/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/gaussian_gen_net_tf/clip_by_value/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/gaussian_gen_net_tf/Reshape_1/shape", "shape": [3], "dtype": "int32"}, {"name": "ConstantFolding/PartitionedCall/gaussian_gen_net_tf/truediv_recip", "shape": [], "dtype": "float32"}]}]}